[
    {
        "id": 1,
        "title": "TabSquare Connect",
        "description": "This project is undisclosed because under Non-disclosure agreement.",
        "image": "https://media.licdn.com/dms/image/C4E33AQEdbgnWKwqRqA/productpage-image_1128_635/0/1622827091606?e=2147483647&v=beta&t=xpbKnRz9J456-PO0YB_w_WX3maR-8nZ-aeHhW3MJVhs",
        "detail": "<p><strong>TabSquare SmartConnect</strong></p><p>The smart solution that enables control of your online and offline ordering needs in one platform while integrating seamlessly with your&nbsp;existing Point-of-Sale (POS) and Kitchen system. Connect all your Online Channels to one Centralized Platform with TabSquare SmartConnect. Seamlessly connect everything directly to your existing POS &amp; Kitchen systems so that you can focus on growing your business</p><p><strong>Tabsquare</strong></p><p>TabSquare provides AI-powered technology solutions for the F&amp;B industry. Through TabSquare&#39;s solutions, restaurants can efficiently manage orders, process payments, and effectively engage with their customers. TabSquare assists partner restaurants in driving higher sales, streamlining operations, and delivering an enhanced customer experience. TabSquare is a market leader with operations in Singapore, Malaysia, Indonesia, Australia, the Philippines, Taiwan, Thailand, Hong Kong, Sweden, and the UAE. Trusted by thousands of restaurants, TabSquare&#39;s clients include well-known F&amp;B brands such as Pizza Hut, KFC, Minor Food Group, Sushi Tei, Paradise Food Group, Japan Foods Holding, Zingrill Holdings, The Coffee Club, Old Town White Coffee, Secret Recipe, and many more. TabSquare is a wholly owned subsidiary of Delivery Hero, a global leader in the food delivery industry. For more information, visit http://www.tabsquare.ai.</p>",
        "achievement": "<ul><li style=\"list-style-type:disc\"><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\"><strong>Led</strong></span></span></span><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\">&nbsp; small team of dev and QA of the SmartConnect squad to provide technical improvements and optimization.</span></span></span></li><li style=\"list-style-type:disc\"><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\">Achieved</span></span></span><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\"><strong>a significant reduction</strong></span></span></span><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\">in multiple services response time, decreasing it by over 80% (from 10+ seconds to 2 seconds or less) by moving the services to GKE and did a query optimization, caching, etc.</span></span></span></li><li style=\"list-style-type:disc\"><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\"><strong>Ensured </strong></span></span></span><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\">the code quality aligns with the best practice by implementing code review, unit test, and prettier.</span></span></span></li><li style=\"list-style-type:disc\"><span style=\"font-size:10pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"\">Managed identification and resolution of performance and memory issues, applying optimizations for improved system efficiency and stability.</span></span></span></li></ul>",
        "technology": "Node, Express, MySQL, Redis, DataDog, GCP, Optimization",
        "publicUrls": "https://tabsquare.ai/smart-connect/",
        "date": "2022 - 2024"
    },
    {
        "id": 2,
        "title": "Rakuten RTX Property/Hotel App",
        "description": "This project is undisclosed because under Non-disclosure agreement.",
        "image": "https://ttgasia.2017.ttgasia.com/wp-content/uploads/sites/2/2021/08/Rakuten-Travel-Xchange-SS.jpg",
        "detail": "<p>Rakuten Travel Xchange, a Singapore based accommodation wholesale and travel technology service, with a dominant inventory in Japan and a robust global offering.</p><p>With local representatives in numerous countries and regions, we are rapidly expanding our global supply and demand, providing global reach and easy access to accommodation inventories through a single source.</p><p>The customers can access worldwide accommodation inventory via a single API connection, a custom-built website or our Travel Agent Portal, without spending valuable resources on integrating multiple supply partners.</p><p>Part of the Rakuten group which operates more than 70 businesses span e-commerce, digital content, communications and fintech with almost 1.6 billion members across the world.</p>",
        "achievement": "<ul><li style=\"list-style-type:disc\">Contributed to the development of Super Room and Travel Experiences products.</li><li style=\"list-style-type:disc\">Implemented features while ensuring unit tests passed successfully, devised a scalable and efficient database architecture.</li><li style=\"list-style-type:disc\">Architecting an email system which support dual language and multiple template for the Rakuten Travel Experiences product</li></ul>",
        "technology": "Sentry, NuxtJS, ExpressJS, PostgreSQL, VueJS, GCP, Redis, Sequelize, Kong API, Docker",
        "publicUrls": "https://www.linkedin.com/company/rakuten-travel-xchange/",
        "date": "2021 - 2022"
    },
    {
        "id": 3,
        "title": "Rakuten Travel Experiences",
        "description": "This project is undisclosed because under Non-disclosure agreement.",
        "image": "https://tourteller.com/blog/wp-content/uploads/2021/08/Rakuten-Travel-Experiences-Home.jpg",
        "detail": "<p>Rakuten Travel Experiences, formerly Voyagin, is a booking platform by Rakuten offering tours and travel experiences in and out of Japan.&nbsp;</p><p>Rakuten is a leading global company offering more than 70 services to over 1.5 billion global members, including Rakuten Travel: Japan&rsquo;s largest travel website.&nbsp;</p><p>Voyagin (now Rakuten Travel Experiences) was a tour and activity online booking platform headquartered in Tokyo. The company was founded in 2011 as FindJPN, rebranded as Voyagin in 2012 by its founders, then rebranded again by Rakuten.</p><p>In July 2015, Rakuten announced it acquired a majority stake in Voyagin to expand its travel market in Asia. Rakuten absorbed Voyagin on July 1, 2020, while retaining the Voyagin name and website. In December 2021, the company changed its name to Rakuten Travel Experiences and relaunched with a new website.</p>",
        "achievement": "<ul><li style=\"list-style-type:disc\">Contributed to the development of Super Room and Travel Experiences products.</li><li style=\"list-style-type:disc\">Implemented features while ensuring unit tests passed successfully, devised a scalable and efficient database architecture.</li><li style=\"list-style-type:disc\">Architecting an email system which support dual language and multiple template for the Rakuten Travel Experiences product</li></ul>",
        "technology": "Sentry, NuxtJS, ExpressJS, PostgreSQL, VueJS, GCP, Redis",
        "publicUrls": "https://experiences.travel.rakuten.com/",
        "date": "2021 - 2022"
    },
    {
        "id": 4,
        "title": "Sultan Ads Facebook Automation",
        "description": "Build a Facebook automation tool for Sultan Ads to help them manage their Facebook ads and campaigns.",
        "image": "/img/consultant-assets/sultan-ads-1.png",
        "galleries": [
            "/img/consultant-assets/sultan-ads-1.png",
            "/img/consultant-assets/sultan-ads-2.png",
            "https://file.notion.so/f/f/fd1c4390-a833-4ae2-8e78-cf41b075fc30/c994495d-e234-428c-a7f6-00c9ffb31390/Untitled.png?id=f1e303bb-bb3d-4cfd-a48c-a495f4314d2a&table=block&spaceId=fd1c4390-a833-4ae2-8e78-cf41b075fc30&expirationTimestamp=1709460000000&signature=sZPMy9CJa_t868VNyLxfyMFAIXIi15PgYsPcplzkzMw&downloadName=Untitled.png",
            "https://file.notion.so/f/f/fd1c4390-a833-4ae2-8e78-cf41b075fc30/343986c4-a4a1-4b9f-97b1-f827ca29ea88/Untitled.png?id=901b168e-6730-4d28-81ae-5cfe53eb10f0&table=block&spaceId=fd1c4390-a833-4ae2-8e78-cf41b075fc30&expirationTimestamp=1709460000000&signature=UC9mx0Bbqo5qm7DHRC3iXatfjLWzbOg_u073LmVXwnM&downloadName=Untitled.png",
            "https://file.notion.so/f/f/fd1c4390-a833-4ae2-8e78-cf41b075fc30/63d0314e-e2b9-4f3f-92b4-c427b464b339/Untitled.png?id=911f2489-6146-47f8-8e41-fc81752cdcfc&table=block&spaceId=fd1c4390-a833-4ae2-8e78-cf41b075fc30&expirationTimestamp=1709460000000&signature=CNGp5wCzzgEzCIFdqia5UdORSJI4L4c7TawBolfRBtg&downloadName=Untitled.png"
        ],
        "detail": "<p>Sultan Ads is a Facebook automation tool for Sultan Ads to help them manage their Facebook ads and campaigns. It will help advertiser to manage their ads budget and prevent them exceeding their desired budget. It also has an ability to create an ad campaign in bulk from specific filter that user deciede.</p>",
        "achievement": "<ul><li style=\"list-style-type:disc\">Initialized and built a scalable system serving over 1000 users using NodeJS, NuxtJS, and MongoDB as founding engineer.</li><li style=\"list-style-type:disc\">Resolved MongoDB performance issues by optimizing read and write bottlenecks in ad logging features and achieved significant reduction in API latency by optimizing MongoDB indexing and querying for 200 rows of logger data.</li><li style=\"list-style-type:disc\">Reducing frontend data loading time by implementing frontend localstorage cache.</li><li style=\"list-style-type:disc\">Improving the architecture and removing code redundancy in ads/campaign management.</li></ul>",
        "technology": "Sentry, NuxtJS, ExpressJS, MySQL, MongoDB, Alibaba Cloud, Redis, Sequelize",
        "publicUrls": "https://sultanads.com/, https://app.sultanads.com/",
        "date": "2019 - 2021"
    },
    {
        "id": 5,
        "title": "Logizee App",
        "description": "Build a logistic management system for Logizee to help them manage their logistic and truck delivery system.",
        "image": "/img/consultant-assets/logizee-1.png",
        "galleries": [
            "/img/consultant-assets/logizee-1.png",
            "/img/consultant-assets/logizee-2.png",
            "/img/consultant-assets/logizee-3.png",
            "/img/consultant-assets/logizee-4.png",
            "/img/consultant-assets/logizee-5.png"
        ],
        "detail": "<p>Logizee is a logistic app to help company manager their driver, truck, and delivery. It will take care th truck plat expiration and tax reminder.</p><p>&nbsp;</p><p>It has several feature:</p><p>- Trucking management</p><p>- Driver management</p><p>- Delivery management</p><p>- Truck tracking</p>",
        "achievement": "<p>- Building entire tracking system from frontend to backend</p><p>- Designing tracking and notification system, including read notification trigger</p><p>- Building tracking map to track truck by mobile app and GPS hardware device</p><p>- Connecting the system using partner GPS API</p>",
        "technology": "React Hooks, NextJS, Laravel, PosgreSQL, Firebase, MapBox, Leaflet, GPS API",
        "publicUrls": "https://logizee.com/",
        "date": "2022"
    },
    {
        "id": 6,
        "title": "Better Youth App",
        "description": "Mobile web app for Better Youth to help them manage their program and event.",
        "image": "/img/consultant-assets/byf-1.png",
        "galleries": [
            "/img/consultant-assets/byf-1.png",
            "/img/consultant-assets/byf-2.png",
            "/img/consultant-assets/byf-3.png",
            "/img/consultant-assets/byf-4.png",
            "/img/consultant-assets/byf-5.png"
        ],
        "detail": "<p>A mobile web app to manage event, participant, and absent for a youth community.&nbsp;</p><p>It can register participant for a particular event and generates barcode for later to be used for confirmation.</p><p>For the event officer they can scan the barcode for confirmation upon arriving to the event venue.</p><p>After the user register an event, prior the event time they will get a web notification that's handled via Firebase messaging.</p>",
        "achievement": "<ul><li>- Setup NextJS from scratch and building reusable layout, like Container, Header, Navbar.</li><li>- Implementing scanner feature and make sure it didn't call the API for multiple time during scanning.</li><li>- API integration.</li><li>- Setup authentication using internal API strategy.</li></ul>",
        "technology": "Frontend development, NextJS, TailwindCSS, AntDesign, Firebase",
        "publicUrls": "https://mkm.betteryouth.id/",
        "date": "2023"
    }
]
